#include  "config.H"

bit Time0_flag=0;	//定时器T0中断标志位
//bit Time1_flag=0;	//定时器T1中断标志位
bit  T_S0_flag=0;	 

/*定义全局变量*/
uchar dat1,dat2,dat3; dat4,dat5,dat6; //显示用变量
uint Pt,S0,T,D,T0_S=179;		      //计数用的变量
/****************************************************************
函数名：LED显示用延时函数
调  用：delay();
参  数：无
返回值：无
结  果：占用CPU方式延时500微秒时间
备  注：晶振24.0m 1T模式，每个机器周期为0.06254US；
/****************************************************************/
void delay(void)   //误差 -0.46875us
{
    uchar a,b;
    for(b=20;b>0;b--)
        for(a=3;a>0;a--);
}