#ifndef __DS1302_H__
#define __DS1302_H__
#include "STC15Fxxxx.h"
#include "Time.h"

/******************************************************************************
防止头文件被重复编译

/******************************************************************************
定义DS1302时钟接口
******************************************************************************/
sbit clock_clk = P4^2;				//ds1302_clk（时钟线）
sbit clock_dat = P4^3;				//ds1302_dat（数据线）
sbit clock_Rst = P4^1;				//ds1302_Rst（复位线）
/******************************************************************************
    子函数声明
******************************************************************************/
extern void clock_out(uchar dat);
extern void write_clock(uchar ord, uchar dd);  //DS1302写入数据（底层协议）
extern uchar clock_in(void);        //DS1302写入字节（底层协议）
extern uchar read_clock(uchar ord);	//DS1302读取数据（底层协议）
extern void Init_1302(void);        //设置1302的初始时间
extern void time_first_read(void);	//第一次读时间
extern void time_refurbish() ;

extern  uchar xdata disp_time[19]; 
#endif
/******************************************************************************
                              END
******************************************************************************/