#include "Exti.h"

//#include "povdat.h" 
uint D=400;
bit Int0_flag;
//uint Pt;
//uchar T0_S=179;

/*********************************************************************************************
函数名：外部中断INT初始化函数
调  用：INT_init();
参  数：无
返回值：无
结  果：启动外部中断INT1、INT0中断，设置中断方式
备  注：
/**********************************************************************************************/
void Exti_init (void)
{
	 IT0=1;			 //外中断0触发方式,为1时为下降沿有效,为0时低电平有效
	 IT1=1;           //外中断1触发方式, 为1时为下降沿有效,为0时低电平有效
 	 EX0=1;			 //外中断0使能标志
	 EX1=1;			 //外中断1使能标志
	 EA=1;	         //开总中断；
}
/**********************************************************************************************/


/********************* INT0中断函数 *************************/
void Ext_INT0 (void) interrupt 0  using 2		//进中断时已经清除标志
{
	/*
	TR0=0;
	D+=(T0_S-180)*2;   //修正值
   	Pt=600+D;       //得到定时器T0的初设值
	TH0=-Pt/256;TL0=-Pt%256;   //设置定时器T0的初设值
	T0_S=0;            //计数器清零，将重新计数	
	TR0=1;
	*/
	Int0_flag=1;
	//line_now=0;
	speed++;
	EX0=0;				//关外中断
	D+=(T0_S-180)*2;   //修正值
   	Pt=600+D;       //得到定时器T0的初设值
	TH0=-Pt/256;TL0=-Pt%256;   //设置定时器T0的初设值
	T0_S=0;            //计数器清零，将重新计数	
	line_now=0;
	EX0=1;				//开外中断
}

